# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# [2, 3, 4, 5, 6] => [12, 15, 16];
# [2, 3, 5, 6] => [12, 15]


from math import ceil

lst = [2, 3, 4, 5, 6]
print([lst[i] * lst[-1-i] for i in range(ceil(len(lst)/2))])
